tutorial/Turning35_mod/background/system/setFieldsDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    boxToCell
    {
        box (-1000 -1000 -1000) (1000 1000 0);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    
    // Set patch values (using ==)

    boxToFace
    {
        box (-1000 -1000 -1000) (1000 1000 0);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
        
);


// ************************************************************************* //
